# GetBoundaryConditionsType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..GetBoundaryConditionsType Method
BoundaryConditions Class See Also
---
Returns the boundary conditions type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public BoundaryConditionsType GetBoundaryConditionsType()
```

Visual Basic
---
```text
Public Function GetBoundaryConditionsType As BoundaryConditionsType
```

Visual C++
---
```text
public:
BoundaryConditionsType GetBoundaryConditionsType()
```

# ### Return Value
The boundary conditions type.
# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace